// data.js
export const division_districts = {
    চট্টগ্রাম: [
      "কুমিল্লা", "ফেনী", "ব্রাহ্মণবাড়িয়া", "রাঙ্গামাটি", "নোয়াখালী",
      "চাঁদপুর", "লক্ষ্মীপুর", "চট্টগ্রাম", "কক্সবাজার", "খাগড়াছড়ি", "বান্দরবান"
    ],
    রাজশাহী: [
      "সিরাজগঞ্জ", "পাবনা", "বগুড়া", "রাজশাহী", "নাটোর", "জয়পুরহাট", "চাঁপাইনবাবগঞ্জ", "নওগাঁ"
    ],
    খুলনা: [
      "যশোর", "সাতক্ষীরা", "মেহেরপুর", "নড়াইল", "চুয়াডাঙ্গা", "কুষ্টিয়া", "মাগুরা", "খুলনা",
      "বাগেরহাট", "ঝিনাইদহ"
    ],
    বরিশাল: [
      "ঝালকাঠি", "পটুয়াখালী", "পিরোজপুর", "বরিশাল", "ভোলা", "বরগুনা"
    ],
    সিলেট: [
      "সিলেট", "হবিগঞ্জ", "সুনামগঞ্জ", "মৌলভীবাজার"
    ],
    ঢাকা: [
      "নরসিংদী", "গাজীপুর", "শরীয়তপুর", "নারায়ণগঞ্জ", "টাঙ্গাইল", "কিশোরগঞ্জ", "মানিকগঞ্জ", "ঢাকা",
      "মুন্সিগঞ্জ", "রাজবাড়ী", "মাদারীপুর", "গোপালগঞ্জ", "ফরিদপুর"
    ],
    রংপুর: [
      "পঞ্চগড়", "দিনাজপুর", "লালমনিরহাট", "নীলফামারী", "গাইবান্ধা", "ঠাকুরগাঁও", "রংপুর", "কুড়িগ্রাম"
    ],
    ময়মনসিংহ: [
      "শেরপুর", "ময়মনসিংহ", "জামালপুর", "নেত্রকোণা"
    ]
  };
  
  export const bangla_days = ["শনিবার", "রবিবার", "সোমবার", "মঙ্গলবার", "বুধবার", "বৃহস্পতিবার", "শুক্রবার"];
  
  export const vehicle_types = [
    "মোটরসাইকেল", "সাইকেল", "বাইক", "বাস", "ট্রাক", "কার", "প্রাইভেট কার", "অটোরিকশা", "রিকশা", "রিক্সা",
    "ট্রেন", "স্কুটার", "গাড়ি", "মাইক্রোবাস", "স্কুটি", "স্কুটার", "মোটর বাইক", "হোণ্ডা"
  ];
  